---------------------------------------------------------------------------------------------------------------------------------
       log:  C:\Research\AshrafGalor\paper\genetic\Final\empirics\results\TableD3.log
  log type:  text
 opened on:  28 Mar 2012, 15:47:40

. use "data\country.dta", clear ;

. /* -------- */
> /* COLUMN 1 */
> /* -------- */
> 
> preserve ;

. drop if cleanlim == 0 ;
(187 observations deleted)

. x_ols2 conley_coord1 conley_coord2 conley_cutoff1 conley_cutoff2 
>        ln_pd1500 mdist_hgdp mdist_hgdp_sqr conley_const, xreg(3) coord(2) ;


     Results for Cross Sectional OLS corrected for Spatial Dependence

                                   number of observations=  21
 Dependent Variable= ln_pd1500

variable              ols estimates   White s.e.   s.e. corrected    P>|z| corrected
--------              -------------   ----------   --------------    ---------------
mdist_hgdp            .50468773       .20785475    .11049637         4.937e-06
mdist_hgdp_sqr        -.02296527      .00821933    .00419165         4.282e-08
conley_const          -.43788971      .91584963    .66171199         .50812972

. restore ;

. /* -------- */
> /* COLUMN 2 */
> /* -------- */
> 
> preserve ;

. drop if cleanlim == 0 ;
(187 observations deleted)

. x_ols2 conley_coord1 conley_coord2 conley_cutoff1 conley_cutoff2 
>        ln_pd1500 adiv adiv_sqr mdist_hgdp mdist_hgdp_sqr conley_const, xreg(5) coord(2) ;


     Results for Cross Sectional OLS corrected for Spatial Dependence

                                   number of observations=  21
 Dependent Variable= ln_pd1500

variable              ols estimates   White s.e.   s.e. corrected    P>|z| corrected
--------              -------------   ----------   --------------    ---------------
adiv                  255.21936       230.40757    77.933327         .00105721
adiv_sqr              -209.80785      162.50679    58.315228         .00032089
mdist_hgdp            .07021874       .32275954    .13822603         .61145377
mdist_hgdp_sqr        -.01417389      .01618376    .00755116         .06051172
conley_const          -72.500074      82.269563    27.437544         .00823287

. restore ;

. /* -------- */
> /* COLUMN 3 */
> /* -------- */
> 
> preserve ;

. drop if cleanlim == 0 | hmicost_hgdp == . ;
(190 observations deleted)

. x_ols2 conley_coord1 conley_coord2 conley_cutoff1 conley_cutoff2 
>        ln_pd1500 hmicost_hgdp hmicost_hgdp_sqr conley_const, xreg(3) coord(2) ;


     Results for Cross Sectional OLS corrected for Spatial Dependence

                                   number of observations=  18
 Dependent Variable= ln_pd1500

variable              ols estimates   White s.e.   s.e. corrected    P>|z| corrected
--------              -------------   ----------   --------------    ---------------
hmicost_hgdp          .35252495       .19478827    .10784554         .00108007
hmicost_hgdp_sqr      -.0123041       .00567547    .0030708          .00006155
conley_const          -.65155547      1.2105757    .79987019         .41531476

. restore ;

. /* -------- */
> /* COLUMN 4 */
> /* -------- */
> 
> preserve ;

. drop if cleanlim == 0 | hmicost_hgdp == . ;
(190 observations deleted)

. x_ols2 conley_coord1 conley_coord2 conley_cutoff1 conley_cutoff2 
>        ln_pd1500 adiv adiv_sqr hmicost_hgdp hmicost_hgdp_sqr conley_const, xreg(5) coord(2) ;


     Results for Cross Sectional OLS corrected for Spatial Dependence

                                   number of observations=  18
 Dependent Variable= ln_pd1500

variable              ols estimates   White s.e.   s.e. corrected    P>|z| corrected
--------              -------------   ----------   --------------    ---------------
adiv                  361.42046       306.48677    108.69192         .00088361
adiv_sqr              -268.51446      210.28653    77.739647         .00055229
hmicost_hgdp          .05102833       .26792096    .12495018         .68298781
hmicost_hgdp_sqr      -.002624        .01245207    .00481188         .58553559
conley_const          -119.33376      111.7401     38.431164         .00190195

. restore ;

. /* -------- */
> /* COLUMN 5 */
> /* -------- */
> 
> preserve ;

. drop if cleanlim == 0 ;
(187 observations deleted)

. reg adiv mdist_addis ln_yst ln_arable ln_abslat ln_suitavg, robust ;

Linear regression                                      Number of obs =      21
                                                       F(  5,    15) =   66.02
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.9644
                                                       Root MSE      =  .01223

------------------------------------------------------------------------------
             |               Robust
        adiv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 mdist_addis |  -.0081424   .0006385   -12.75   0.000    -.0095033   -.0067816
      ln_yst |  -.0169382   .0062178    -2.72   0.016    -.0301911   -.0036854
   ln_arable |    .000062   .0033722     0.02   0.986    -.0071257    .0072497
   ln_abslat |   .0034789   .0018786     1.85   0.084    -.0005251    .0074829
  ln_suitavg |    .005479   .0046798     1.17   0.260    -.0044958    .0154537
       _cons |   .9209486   .0523699    17.59   0.000     .8093248    1.032572
------------------------------------------------------------------------------

. predict adivhat, xb ;

. gen adivhat_sqr = adivhat ^ 2 ;

. x_gmm2 conley_coord1 conley_coord2 conley_cutoff1 conley_cutoff2 
>        ln_pd1500 adiv adiv_sqr ln_yst ln_arable ln_abslat ln_suitavg conley_const 
>            mdist_addis adivhat_sqr ln_yst ln_arable ln_abslat ln_suitavg conley_const, xreg(7) inst(7) coord(2) ;


     Results for 2-Step Spatial GMM

                    number of observations=  21

                    crit. fn. test of overid. restrictions=  5.116e-09

Dependent variable= ln_pd1500

variable              2SLS Est.       2SLS SE    Spatial GMM Est.  Spatial GMM SE   P>|z| corrected
--------              -------------   ---------  ----------------  --------------   ---------------
adiv                  285.19086       84.59124   285.19086         81.537697        .00046937
adiv_sqr              -206.57664      63.858959  -206.57664        61.906246        .0008471
ln_yst                1.0140897       .39637154  1.0140897         .35603979        .00439606
ln_arable             .60834277       .1913873   .60834277         .18722561        .0011571
ln_abslat             -.20934902      .14161198  -.20934902        .10653365        .04940293
ln_suitavg            .49382797       .19126931  .49382797         .22651014        .02924572
conley_const          -105.03318      25.801577  -105.03317        24.458849        .00001753

. restore ;

. /* -------- */
> /* COLUMN 6 */
> /* -------- */
> 
> preserve ;

. drop if cleanlim == 0 ;
(187 observations deleted)

. reg adiv mdist_addis ln_yst ln_arable ln_abslat ln_suitavg africa europe americas, robust ;

Linear regression                                      Number of obs =      21
                                                       F(  8,    12) =  112.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.9805
                                                       Root MSE      =  .01012

------------------------------------------------------------------------------
             |               Robust
        adiv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 mdist_addis |  -.0065682   .0019609    -3.35   0.006    -.0108406   -.0022958
      ln_yst |  -.0129509   .0044437    -2.91   0.013    -.0226329    -.003269
   ln_arable |   .0021504   .0035938     0.60   0.561    -.0056798    .0099806
   ln_abslat |   .0046045   .0024971     1.84   0.090    -.0008363    .0100453
  ln_suitavg |   .0051878   .0046928     1.11   0.291     -.005037    .0154125
      africa |   .0087436   .0137799     0.63   0.538    -.0212801    .0387674
      europe |  -.0128559   .0097728    -1.32   0.213     -.034149    .0084371
    americas |  -.0286206   .0212941    -1.34   0.204    -.0750163    .0177752
       _cons |   .8697331   .0506073    17.19   0.000     .7594693    .9799969
------------------------------------------------------------------------------

. predict adivhat, xb ;

. gen adivhat_sqr = adivhat ^ 2 ;

. x_gmm2 conley_coord1 conley_coord2 conley_cutoff1 conley_cutoff2 
>        ln_pd1500 adiv adiv_sqr ln_yst ln_arable ln_abslat ln_suitavg africa europe americas conley_const 
>            mdist_addis adivhat_sqr ln_yst ln_arable ln_abslat ln_suitavg africa europe americas conley_const, xreg(10) inst(10)
>  coord(2) ;


     Results for 2-Step Spatial GMM

                    number of observations=  21

                    crit. fn. test of overid. restrictions=  2.830e-09

Dependent variable= ln_pd1500

variable              2SLS Est.       2SLS SE    Spatial GMM Est.  Spatial GMM SE   P>|z| corrected
--------              -------------   ---------  ----------------  --------------   ---------------
adiv                  243.10765       95.881317  243.10765         55.325111        .00001112
adiv_sqr              -179.57892      76.877007  -179.57892        44.270954        .00004984
ln_yst                1.1185497       .44979429  1.1185497         .37049073        .00253524
ln_arable             .63374007       .22536884  .63374007         .20215456        .00171896
ln_abslat             -.13304873      .15483785  -.13304873        .09905793        .17922644
ln_suitavg            .54891968       .19239351  .54891968         .24225229        .02345745
africa                .23809685       1.0566816  .23809685         .54627645        .66294259
europe                -.39572653      .41634601  -.39572653        .45855725        .3881475
americas              -.93509251      1.0896155  -.93509251        .81811088        .25304276
conley_const          -89.771988      29.536686  -89.771988        16.036434        2.168e-08

. restore ;

. log close ;
       log:  C:\Research\AshrafGalor\paper\genetic\Final\empirics\results\TableD3.log
  log type:  text
 closed on:  28 Mar 2012, 15:47:41
---------------------------------------------------------------------------------------------------------------------------------
